import { existsSync } from 'fs';
import { InputFile } from 'grammy';
import { fileURLToPath } from 'url';
import { dirname, join } from 'path';

const __filename = fileURLToPath(import.meta.url);
const __dirname = dirname(__filename);

// Текст сообщения об этапах выращивания тюльпанов.
export let growingProcess = {
  image: () => {
    const filePath = join(__dirname, '../imgs/tulpans.jpg');
    if (!existsSync(filePath)) {
      throw new Error(`Файл не найден: ${filePath}`);
    }
    return new InputFile(filePath, 'tulips.jpg');
  },
  title: '<b>Основные этапы выращивания тюльпанов 🌷.</b>',
  text: `
  <b>Этап 1. 🧅 Подготовка луковиц:</b>\n
  ● Отбираете самые здоровые и плотные луковицы без повреждений.
  ● Перед посадкой очищаете от лишних сухих чешуек.
  ● Для достижения лучшего результата перед посадкой замочить луковицы в слабом растворе марганцовки, на 10-15 минут.\n\n<b>Этап 2. 🪏 Посадка и уход:</b>\n
  ● Сажать тюльпаны нужно осенью в прохладную, рыхлую почву на глубину 2-3 высоты луковицы.
  ● Выбираете солнечное место с хорошим дренажем.
  ● Поливаете сразу после посадки и при необходимости — в период роста.
  ● Весной проводить рыхление, удаление сорняков, лёгкие подкормки.\n\n<b>Этап 3. 🌷 Формирование бутонов:</b>\n
  ● В период роста следить за влажностью — почва должна быть умеренно влажной, не нужно поливать слишком обильно.
  ● Следить за температурой. Температура должна быть около +12 - +16 °C. Такая температура обеспечивает формирование крепкого стебля и плотного бутона.
  ● Можно также вносить калийно-фосфорные удобрения для крепких бутонов.\n\n<b>Этап 4. 💐 Сбор и упаковка:</b>\n
  ● Срезать тюльпаны нужно в фазе полуокрашенного бутона (когда он ещё не полностью раскрыт).
  ● Срез делать рано утром или вечером, когда растения максимально упругие.
  ● После срезки поставить цветы в холодную воду или упаковывать сухим способом в холодильное хранение.
  ● Для транспортировки использовать плотную упаковку и поддерживать прохладную температуру.\n\n\n<b>Дополнительную информацию и ещё больше полезных советов можно узнать в нашем канале – @tulpanski🌷.</b>
  `.trim(),
};

export let assortimentInfo = {
  price: 10,
  image1: () => {
    const filePath = join(__dirname, '../imgs/TulpansRed.jpg');
    if (!existsSync(filePath)) {
      throw new Error(`Файл не найден: ${filePath}`);
    }
    return new InputFile(filePath, 'TulpansRed.jpg');
  },
  image2: () => {
    const filePath = join(__dirname, '../imgs/TulpansYellow.jpg');
    if (!existsSync(filePath)) {
      throw new Error(`Файл не найден: ${filePath}`);
    }
    return new InputFile(filePath, 'TulpansYellow.jpg');
  },
  image3: () => {
    const filePath = join(__dirname, '../imgs/TulpansPink.jpg');
    if (!existsSync(filePath)) {
      throw new Error(`Файл не найден: ${filePath}`);
    }

    return new InputFile(filePath, 'TulpansPink.jpg');
  },
  get text() {
    return `
    <b>🌷 Однотонные тюльпаны 🌷</b>\n
    ❤️<b>Красные</b>❤️\n
    💛<b>Жёлтые</b>💛\n
    🩷<b>Розовые</b>🩷\n\n<b>Цена:</b>\n1 тюльпан - ${this.price} руб\n\n<b>Для уточнения цен или заказа пишите нашему менеджеру – @tulpanski1🌷</b> 
    `.trim();
  },
};

export let mixSorts = {
  option1: {
    image: () => {
      const filePath = join(__dirname, '../imgs/sweetClassic.jpg');
      if (!existsSync(filePath)) {
        throw new Error(`Файл не найден: ${filePath}`);
      }

      return new InputFile(filePath, 'sweetClassic.jpg');
    },
    text: `
      <b>💐 Микс «Нежная классика» — 25 шт</b>\n\n<b>Состав:</b>\n- Белые тюльпаны — 12\n- Розовые тюльпаны — 13\n\nОбраз: романтичный, утончённый.
    `,
  },
  option2: {
    image: () => {
      const filePath = join(__dirname, '../imgs/sunMix.jpg');
      if (!existsSync(filePath)) {
        throw new Error(`Файл не найден: ${filePath}`);
      }

      return new InputFile(filePath, 'sunMix.jpg');
    },
    text: `
      <b>💐 Микс «Солнечный микс» — 35 шт</b>\n\n<b>Состав:</b>\n- Жёлтые — 20\n- Красные — 15\n\nОбраз: яркий, тёплый, праздничный.
    `,
  },
  option3: {
    image: () => {
      const filePath = join(__dirname, '../imgs/rainbowMix.jpg');
      if (!existsSync(filePath)) {
        throw new Error(`Файл не найден: ${filePath}`);
      }

      return new InputFile(filePath, 'rainbowMix.jpg');
    },
    text: `
      <b>💐 Микс «Радуга весны» — 51 шт</b>\n\n<b>Состав:</b>\n- Красные — 10\n- Жёлтые — 10\n- Белые — 10\n- Розовые — 10\n- Фиолетовые — 11\n\nОбраз: яркий разноцветный букет.
    `,
  },
  option4: {
    image: () => {
      const filePath = join(__dirname, '../imgs/pionMix.jpg');
      if (!existsSync(filePath)) {
        throw new Error(`Файл не найден: ${filePath}`);
      }

      return new InputFile(filePath, 'pionMix.jpg');
    },
    text: `
      <b>💐 Микс «Пионовидная роскошь» — 31 шт</b>\n\n<b>Состав:</b>\n- Махровые белые — 15\n- Махровые розовые — 16\n\nОбраз: пышный, премиальный.
    `,
  },
  option5: {
    image: () => {
      const filePath = join(__dirname, '../imgs/skandiMix.jpg');
      if (!existsSync(filePath)) {
        throw new Error(`Файл не найден: ${filePath}`);
      }

      return new InputFile(filePath, 'skandiMix.jpg');
    },
    text: `
      <b>💐 Микс «Сканди-микс» — 29 шт</b>\n\n<b>Состав:</b>\n- Пудрово-розовые — 10\n- Кремовые — 10\n- Сиреневые пастель — 9\n\nОбраз: минималистичный, модный.
    `,
  },
  option6: {
    image: () => {
      const filePath = join(__dirname, '../imgs/popugaiMix.jpg');
      if (!existsSync(filePath)) {
        throw new Error(`Файл не найден: ${filePath}`);
      }

      return new InputFile(filePath, 'popugaiMix.jpg');
    },
    text: `
      <b>💐 Микс «Попугайный акцент» — 19 шт</b>\n\n<b>Состав:</b>\n- Попугайные розово-зелёные — 9\n- Попугайные бело-розовые — 10\n\nОбраз: необычный акцентный букет.
    `,
  },
  option7: {
    image: () => {
      const filePath = join(__dirname, '../imgs/twoHeartsMix.jpg');
      if (!existsSync(filePath)) {
        throw new Error(`Файл не найден: ${filePath}`);
      }

      return new InputFile(filePath, 'twoHeartsMix.jpg');
    },
    text: `
      <b>💐 Микс «Два сердца» — 33 шт</b>\n\n<b>Состав:</b>\n- Красные — 17\n- Белые — 16\n\nОбраз: контрастный, выразительный.
    `,
  },
  option8: {
    image: () => {
      const filePath = join(__dirname, '../imgs/tulpans.jpg');
      if (!existsSync(filePath)) {
        throw new Error(`Файл не найден: ${filePath}`);
      }

      return new InputFile(filePath, 'mixTulpans.jpg');
    },
    text: `
      <b>💐 Микс «Белоснежный шик» — 25 шт</b>\n\n<b>Состав:</b>\n- Белые классические — 15\n- Белые махровые — 10\n\nОбраз: элегантный и универсальный.
    `,
  },
};
